import random

answer = ["Бесспорно", "Предрешено", "Никаких сомнений", "Определённо да",
          "Можешь быть уверен в этом", "Мне кажется - да",
          "Вероятнее всего", "Хорошие перспективы", "Знаки говорят - да", "Да",
          "Пока неясно, попробуй снова", "Спроси позже",
          "Лучше не рассказывать", "Сейчас нельзя предсказать",
          "Сконцентрируйся и спроси опять",
          "Даже не думай", "Мой ответ - нет", "По моим данным - нет",
          "Перспективы не очень хорошие", "Весьма сомнительно"]
name = input('Привет Мир, я магический шар, и я знаю ответ на любой твой '
             'вопрос.\n Как твоё имя странник?\n')
print(f'Приветствую Вас, {name}!')

while True:
    question = input('Я в предвкушении Вашего вопроса\n')

    print('Хороший вопрос, мой тебе ответ:\n', random.choice(answer))
    one_more = input('\n Остались ещё вопросы?(да/нет)')
    if one_more.lower() != 'да':
        print('Возвращайся, если возникнут вопросы!')
        break

